Indicates if the Analytical Model Surface Element is planar.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool IsPlanar()
  Visual Basic
Public Function IsPlanar As Boolean
  Visual C++
public:
bool IsPlanar()
 Return Value
 True if Analytical Model Surface Element is planar, false otherwise.
 See Also
  AnalyticalModelSurface Class
  Autodesk.Revit.DB.Structure Namespace